ws-asahi/UkiUkiCore/megaavr/boards.txt
# =====================================================================
#  WazamonoCore - boards.txt
#  The Wazamono product boards only (all other MCU/board families from DxCore
#  are removed):
#    - Wazamono Tachi    (AVR64DU32, Pro Micro form factor)
#    - Wazamono Tsurugi  (AVR64DU32, Arduino Uno R3 form factor)
#    - Wazamono Kunai    (AVR32DU20, Seeed XIAO form factor)
#  Derived from DxCore's avrduusb (USB-CDC bootloader) definition;
#  DxCore (C) Spence Konde, LGPL 2.1. Customizations (C) Workshop Asahi.
#
#  All three boards are crystal-less and run from the 24 MHz internal OSCHF.
#  The Clock menu is kept, with '24 MHz internal' as its only (and therefore
#  always-selected) entry, so that additional clock options can be reintroduced
#  later without changing FQBNs or tooling. USB always runs from OSCHF +
#  PLL48M auto-tuned to the USB SOF, independent of the system clock source.
# =====================================================================

menu.clock=Clock Speed
menu.usbeps=USB Endpoints

# =====================  Wazamono Tachi (AVR64DU32)  ==================
wazamonotachi.name=Wazamono Tachi (Pro Micro)

wazamonotachi.upload.tool=avrdude
wazamonotachi.upload.prog_interlock=
wazamonotachi.vid.0=0x1209
wazamonotachi.pid.0=0x0006
wazamonotachi.vid.1=0x1209
wazamonotachi.pid.1=0x0005
wazamonotachi.build.board=WAZAMONO_TACHI
wazamonotachi.build.core=dxcore
wazamonotachi.build.f_cpu={build.speed}000000L
wazamonotachi.build.text_section_start=.text=0x1000
wazamonotachi.build.defaultswaps=
wazamonotachi.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT {build.usbepflags}
wazamonotachi.menu.usbeps.ep8=8 (EP0-EP7, standard)
wazamonotachi.menu.usbeps.ep8.build.usbepflags=
wazamonotachi.menu.usbeps.ep16=16 (EP0-EP15, extended)
wazamonotachi.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/WazamonoTachi/wazamono_tachi_init.cpp).
# Arduino archives variant objects into core.a, so its strong initVariant()/
# activity-LED hooks would otherwise be dropped (core main.cpp has a weak
# initVariant). -u pulls the member; the marker symbol is defined in that file.
wazamonotachi.compiler.c.elf.extra_flags=-Wl,-u,wazamono_tachi_variant_keep -Wl,--defsym,__flmap_lock=1
wazamonotachi.build.rodata_flags=
wazamonotachi.build.export_merged_output=false
wazamonotachi.build.printf=
wazamonotachi.build.flmapopts=
wazamonotachi.build.attachmode=-DCORE_ATTACH_ALL
wazamonotachi.bootloader.tool=avrdude
wazamonotachi.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
wazamonotachi.bootloader.wdtwindowbits=0000
wazamonotachi.bootloader.BODCFG=0x00
wazamonotachi.bootloader.updipinbit=1
wazamonotachi.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
wazamonotachi.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
wazamonotachi.bootloader.CODESIZE=0x00
wazamonotachi.bootloader.BOOTSIZE=0x08
wazamonotachi.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
wazamonotachi.bootloader.wdttimeoutbits=0000
wazamonotachi.bootloader.eesavebit=1
wazamonotachi.bootloader.resetpinbit=1
wazamonotachi.bootloader.sutbits=100
# Compile-time options: millis=TCB0, Wire=Master-or-Slave(single) [.wO above].
#   attach=all-pins, FLMAP=unlocked, printf=default already come from the
#   board-level base values above, so menu removal keeps those defaults.
wazamonotachi.build.millistimer=B0
wazamonotachi.build.wiremode=MORS_SINGLE
wazamonotachi.bootloader.resetpinbits={bootloader.resetpinbit}
wazamonotachi.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotachi.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotachi.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
wazamonotachi.bootloader.pymcuprogstring=-aerase
wazamonotachi.build.mcupostfix=
wazamonotachi.build.printfabr=
wazamonotachi.build.flmapabr=.ful
wazamonotachi.build.attachabr=
wazamonotachi.build.wireabr=.wO
wazamonotachi.build.appspmabr=
wazamonotachi.upload.protocol=arduino
wazamonotachi.upload.speed=115200
wazamonotachi.upload.extra_params=-D
wazamonotachi.upload.use_1200bps_touch=true
wazamonotachi.upload.wait_for_upload_port=true
wazamonotachi.bootloader.file=hex/{bootloader.class}.hex
wazamonotachi.bootloader.appspm=

# --- Clock menu: single entry, 24 MHz internal OSCHF (crystal-less board).
#     clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF + PLL48M,
#     SOF-tuned. PA0/PA1 are not connected on this board (reserved). ---
wazamonotachi.menu.clock.24internal=24 MHz internal
wazamonotachi.menu.clock.24internal.build.speed=24
wazamonotachi.menu.clock.24internal.build.clocksource=0

# --- millis()/micros() timer. TCB0 is the default so TCB1 stays free for
#     D3 PWM and TCA0 stays free for D5-D10 PWM. ---

# --- Locked to AVR64DU32 (chip submenu removed; rev.4 returned from the
#     28-pin part to the 32-pin TQFP). Variant + bootloader hex fixed to
#     Wazamono Tachi. ---
wazamonotachi.build.mcu=avr64du32
wazamonotachi.build.variant=WazamonoTachi
# build.highestcb = the highest-numbered TCB on this MCU. Upstream DxCore uses
#   it only for the Millis menu's "Default (recommended)" option
#   (menu.millis.tcbhighest.build.millistimer={build.highestcb}). WazamonoCore
#   removes that menu and pins millis to TCB0 (build.millistimer=B0 above), so
#   the key is currently unused; it is kept correct in case the menu returns.
#   Every AVR DU part has exactly TWO TCBs (TCB0/TCB1) regardless of pin count
#   - DS40002548A: "Two 16-bit Timer/Counter type B (TCB)", peripheral address
#   map lists only TCB0 (0x0B00) and TCB1 (0x0B10) for 14/20/28/32 pins, and
#   the vector table has only TCB0_INT (15) and TCB1_INT (29). Hence B1, not
#   B2. (Upstream's avrdu rows say B2; that value is carried over from the
#   DD-series, where 28/32-pin parts do have a TCB2.)
wazamonotachi.build.highestcb=B1
wazamonotachi.upload.maximum_size=61440
wazamonotachi.upload.maximum_data_size=8192
wazamonotachi.bootloader.class=usbcdcboot_wazamonotachi
##############################################################

# =====================  Wazamono Tsurugi (AVR64DU32)  ===============
wazamonotsurugi.name=Wazamono Tsurugi (Uno)

wazamonotsurugi.upload.tool=avrdude
wazamonotsurugi.upload.prog_interlock=
wazamonotsurugi.vid.0=0x1209
wazamonotsurugi.pid.0=0x0008
wazamonotsurugi.vid.1=0x1209
wazamonotsurugi.pid.1=0x0007
wazamonotsurugi.build.board=WAZAMONO_TSURUGI
wazamonotsurugi.build.core=dxcore
wazamonotsurugi.build.f_cpu={build.speed}000000L
wazamonotsurugi.build.text_section_start=.text=0x1000
wazamonotsurugi.build.defaultswaps=
wazamonotsurugi.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
wazamonotsurugi.menu.usbeps.ep8=8 (EP0-EP7, standard)
wazamonotsurugi.menu.usbeps.ep8.build.usbepflags=
wazamonotsurugi.menu.usbeps.ep16=16 (EP0-EP15, extended)
wazamonotsurugi.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/WazamonoTsurugi/wazamono_tsurugi_init.cpp).
# The core provides a weak initVariant(); the variant supplies a strong one from an
# archive member, which the linker will not pull without this reference.
wazamonotsurugi.compiler.c.elf.extra_flags=-Wl,-u,wazamono_tsurugi_variant_keep -Wl,--defsym,__flmap_lock=1
wazamonotsurugi.build.rodata_flags=
wazamonotsurugi.build.export_merged_output=false
wazamonotsurugi.build.printf=
wazamonotsurugi.build.flmapopts=
wazamonotsurugi.build.attachmode=-DCORE_ATTACH_ALL
wazamonotsurugi.bootloader.tool=avrdude
wazamonotsurugi.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
wazamonotsurugi.bootloader.wdtwindowbits=0000
wazamonotsurugi.bootloader.BODCFG=0x00
wazamonotsurugi.bootloader.updipinbit=1
wazamonotsurugi.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
wazamonotsurugi.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
wazamonotsurugi.bootloader.CODESIZE=0x00
wazamonotsurugi.bootloader.BOOTSIZE=0x08
wazamonotsurugi.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
wazamonotsurugi.bootloader.wdttimeoutbits=0000
wazamonotsurugi.bootloader.eesavebit=1
wazamonotsurugi.bootloader.resetpinbit=1
wazamonotsurugi.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3 PWM + tone), Wire=single.
wazamonotsurugi.build.millistimer=B0
wazamonotsurugi.build.wiremode=MORS_SINGLE
wazamonotsurugi.bootloader.resetpinbits={bootloader.resetpinbit}
wazamonotsurugi.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotsurugi.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotsurugi.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
wazamonotsurugi.bootloader.pymcuprogstring=-aerase
wazamonotsurugi.build.mcupostfix=
wazamonotsurugi.build.printfabr=
wazamonotsurugi.build.flmapabr=.ful
wazamonotsurugi.build.attachabr=
wazamonotsurugi.build.wireabr=.wO
wazamonotsurugi.build.appspmabr=
wazamonotsurugi.upload.protocol=arduino
wazamonotsurugi.upload.speed=115200
wazamonotsurugi.upload.extra_params=-D
wazamonotsurugi.upload.use_1200bps_touch=true
wazamonotsurugi.upload.wait_for_upload_port=true
wazamonotsurugi.bootloader.file=hex/{bootloader.class}.hex
wazamonotsurugi.bootloader.appspm=

# --- Clock menu: single entry, 24 MHz internal OSCHF. Board rev.C carries
#     no crystal: PA0/PA1 are the CDC TX/RX activity LEDs. USB's 48 MHz comes
#     from PLL48M auto-tuned to the USB SOF, independent of CLK_PER. ---
wazamonotsurugi.menu.clock.24internal=24 MHz internal
wazamonotsurugi.menu.clock.24internal.build.speed=24
wazamonotsurugi.menu.clock.24internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to Wazamono Tsurugi. ---
wazamonotsurugi.build.mcu=avr64du32
wazamonotsurugi.build.variant=WazamonoTsurugi
# build.highestcb: see the note in the Tachi section - all AVR DU parts have
#   exactly two TCBs, so this is B1 here as well.
wazamonotsurugi.build.highestcb=B1
wazamonotsurugi.upload.maximum_size=61440
wazamonotsurugi.upload.maximum_data_size=8192
wazamonotsurugi.bootloader.class=usbcdcboot_wazamonotsurugi
##############################################################

# =====================  Wazamono Kunai (AVR32DU20)  ================
wazamonokunai.name=Wazamono Kunai (Xiao)

wazamonokunai.upload.tool=avrdude
wazamonokunai.upload.prog_interlock=
wazamonokunai.vid.0=0x1209
wazamonokunai.pid.0=0x000A
wazamonokunai.vid.1=0x1209
wazamonokunai.pid.1=0x0009
wazamonokunai.build.board=WAZAMONO_KUNAI
wazamonokunai.build.core=dxcore
wazamonokunai.build.f_cpu={build.speed}000000L
wazamonokunai.build.text_section_start=.text=0x1000
wazamonokunai.build.defaultswaps=
wazamonokunai.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT {build.usbepflags}
wazamonokunai.menu.usbeps.ep8=8 (EP0-EP7, standard)
wazamonokunai.menu.usbeps.ep8.build.usbepflags=
wazamonokunai.menu.usbeps.ep16=16 (EP0-EP15, extended)
wazamonokunai.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/WazamonoKunai/wazamono_kunai_init.cpp).
# Arduino archives variant objects into core.a, so its strong initVariant() (which
# selects TWI0 ALT3 so I2C lands on PA0/PA1 = D4/D5) would otherwise be dropped
# (core main.cpp has a weak initVariant). -u pulls the member; the marker symbol
# is defined in that file.
wazamonokunai.compiler.c.elf.extra_flags=-Wl,-u,wazamono_kunai_variant_keep
wazamonokunai.build.rodata_flags=
wazamonokunai.build.export_merged_output=false
wazamonokunai.build.printf=
wazamonokunai.build.flmapopts=
wazamonokunai.build.attachmode=-DCORE_ATTACH_ALL
wazamonokunai.bootloader.tool=avrdude
wazamonokunai.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
wazamonokunai.bootloader.wdtwindowbits=0000
wazamonokunai.bootloader.BODCFG=0x00
wazamonokunai.bootloader.updipinbit=1
wazamonokunai.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
wazamonokunai.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
wazamonokunai.bootloader.CODESIZE=0x00
wazamonokunai.bootloader.BOOTSIZE=0x08
wazamonokunai.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
wazamonokunai.bootloader.wdttimeoutbits=0000
wazamonokunai.bootloader.eesavebit=1
wazamonokunai.bootloader.resetpinbit=1
wazamonokunai.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for tone), Wire=single.
wazamonokunai.build.millistimer=B0
wazamonokunai.build.wiremode=MORS_SINGLE
wazamonokunai.bootloader.resetpinbits={bootloader.resetpinbit}
wazamonokunai.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonokunai.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonokunai.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
wazamonokunai.bootloader.pymcuprogstring=-aerase
wazamonokunai.build.mcupostfix=
wazamonokunai.build.printfabr=
wazamonokunai.build.flmapabr=.ful
wazamonokunai.build.attachabr=
wazamonokunai.build.wireabr=.wO
wazamonokunai.build.appspmabr=
wazamonokunai.upload.protocol=arduino
wazamonokunai.upload.speed=115200
wazamonokunai.upload.extra_params=-D
wazamonokunai.upload.use_1200bps_touch=true
wazamonokunai.upload.wait_for_upload_port=true
wazamonokunai.bootloader.file=hex/{bootloader.class}.hex
wazamonokunai.bootloader.appspm=

# --- Clock menu: single entry, 24 MHz internal OSCHF (crystal-less board). ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF + PLL48M, SOF-tuned.
wazamonokunai.menu.clock.24internal=24 MHz internal
wazamonokunai.menu.clock.24internal.build.speed=24
wazamonokunai.menu.clock.24internal.build.clocksource=0

# --- Locked to AVR32DU20. Variant + bootloader hex fixed to Wazamono Kunai. ---
wazamonokunai.build.mcu=avr32du20
wazamonokunai.build.variant=WazamonoKunai
# build.highestcb: see the note in the Tachi section - all AVR DU parts have
#   exactly two TCBs, so this is B1 here as well.
wazamonokunai.build.highestcb=B1
wazamonokunai.upload.maximum_size=28672
wazamonokunai.upload.maximum_data_size=4096
wazamonokunai.bootloader.class=usbcdcboot_wazamonokunai
